dudi938/RotalCalib/STM32F072B CDC USB Project/main.c
/***********************************************************
 *
 *   Program:  STM32F072 USB CDC Test      Version: 1.00
 *
 *   Author:  S. Swift					   Date: Sep 9, 2014
 *
 *   This test example application configures the STM32F072 as a CDC USB device
 *   using the CooCox V1.7.7 IDE and STMicroelectronics STM32F0x2_USB-FS-Device_Lib V1.0.0.
 *
 *   This software can be used without restriction as the basis for other applications
 *   and products.  The STM32F072 is a low cost ($2.50) ARM M0 processor running at 48MHz
 *   with 128K of flash, 16K SRAM, A/D, D/A, SPI, USARTs, I2C, HDMI, etc in 48, 64 and 100
 *   pin QFP and QFN package types.  A good, low cost, processor.  We are building the F072
 *   into several new products.
 *
 *   The application configures the USB peripheral as a CDC device, USART3 to 38,400,N,8,1,
 *   TIM3 as 1msec time delay clock, sets up a few other timers and implements a printf,scanf
 *   for USB CDC and printf3 for USART3.  USART3 is interrupt driven.  The RF24L01 code was
 *   ported but not configured or tested with SPI - TBD.
 *
 *   Unless required by applicable law or agreed to in writing, software
 *   distributed under the License is distributed on an "AS IS" BASIS,
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *   See the License for the specific language governing permissions and
 *   limitations under the License. Use at your own risk.
 *
 *   Copyright 2014,  SOC Robotics, Inc.
 ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
 */
/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx.h"
#include "stm32f0xx_conf.h"
#include "stm32072b_eval.h"

#include "usbd_cdc_core.h"
#include "usbd_usr.h"

#include "stdarg.h"
#include "string.h"
#include <stdio.h>
#include <stdlib.h>

USB_CORE_HANDLE  USB_Device_dev ;

/* Private function prototypes -----------------------------------------------*/
void LEDInit(void);
void EXTI0_Config(void);
void TIM_Config(void);
void USARTInit(unsigned long baudrate);

/* Private functions ---------------------------------------------------------*/
/* Uncomment the line below to select your USB clock source */
//#define USE_USB_CLKSOURCE_CRSHSI48   1
//#define USE_USB_CLKSOURCE_PLL        1

#define 	XON   		  0x11
#define 	XOFF  		  0x13
#define 	LF	  		  0x0A
#define 	CR	  		  0x0D
#define  	SPACE 	   	  0x20

#define LED1ON  GPIO_ResetBits(GPIOC,GPIO_Pin_9);
#define LED1OFF  GPIO_SetBits(GPIOC,GPIO_Pin_9);
#define LED0ON  GPIO_ResetBits(GPIOC,GPIO_Pin_8);
#define LED0OFF  GPIO_SetBits(GPIOC,GPIO_Pin_8);

#define LED1HIGH   GPIOC->BSRR = GPIO_Pin_9
#define LED1LOW	   GPIOC->BRR = GPIO_Pin_9
#define LED2HIGH   GPIOC->BSRR = GPIO_Pin_8
#define LED2LOW	   GPIOC->BRR = GPIO_Pin_8

// STM32F042 defines
#define PWMACTIVE  'a'
#define CMDACTIVE  'c'
#define INACTIVE 'i'
#define YES     'y'
#define NO      'n'
#define HIGH	'h'
#define LOW		'l'

TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
TIM_OCInitTypeDef  TIM_OCInitStructure;
TIM_ICInitTypeDef  TIM_ICInitStructure;

FILE *fpout;

#define     USB_RX_BUFFERSIZE 512

int usbrxheadptr=0, usbrxtailptr=0;
unsigned char usbrxbuffer[USB_RX_BUFFERSIZE];

#define     USART3_TX_BUFSIZE 80
#define     USART3_RX_BUFSIZE 80

int tx3headptr,tx3tailptr,rx3headptr,rx3tailptr;
unsigned char rx3buffer[USART3_RX_BUFSIZE],tx3buffer[USART3_TX_BUFSIZE];

char flip=0,grnflip=0,redflip=0;
uint16_t TimerPeriod = 0;
uint16_t Channel1Pulse = 0, Channel2Pulse = 0, Channel3Pulse = 0, Channel4Pulse = 0;
unsigned int mseccountdown1,mseccountdown2,mseccountdown3;
__IO uint16_t IC2Value = 0;
__IO uint16_t DutyCycle = 0;
__IO uint32_t Frequency = 0;

/***********************************************
 *
 *  Initialization Functions
 *
 ***********************************************/
/**
  * @brief  Configures LED GPIO.
  */
void LED_Init(void)
{
	GPIO_InitTypeDef  GPIO_InitStructure;

	/* Enable the GPIO_LED Clock */
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE);

	/* Configure the GPIO_LED pin */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9;
	//  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
}

/**
  * @brief  Configures COM port.  Supports buffered interrupt IO
  */
void USART3_Init(unsigned long baudrate)
{
    GPIO_InitTypeDef GPIO_InitStructure;
    USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;

    // Initialize interrupt tx rx buffers
    tx3headptr = tx3tailptr = rx3headptr = rx3tailptr = 0;

    /* USARTx configured as follow:
    - BaudRate = 115200 baud
    - Word Length = 8 Bits
    - One Stop Bit
    - No parity
    - Hardware flow control disabled (RTS and CTS signals)
    - Receive and transmit enabled
    */
    USART_InitStructure.USART_BaudRate = baudrate;
    //USART_InitStructure.USART_BaudRate = 115200;
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

