dudi938/RotalCalib/STM32F072B CDC USB Project/main.c
	To get TIM3 counter clock at 6 MHz, the prescaler is computed as follows:
	   Prescaler = (TIM3CLK / TIM3 counter clock) - 1
	   Prescaler = (PCLK1 /6 MHz) - 1

	CC3 update rate = TIM3 counter clock / CCR3_Val = 439.4 Hz
	==> Toggling frequency = 219.7 Hz

	----------------------------------------------------------------------- */

	/* Compute the prescaler value */
	PrescalerValue = (uint16_t) (SystemCoreClock  / 6000000) - 1;
	//PrescalerValue = 0;

	CCR3_Val = 1000;
	mseccountdown1 = mseccountdown2 = mseccountdown3 = 0;

	/* Time base configuration */
	TIM_TimeBaseStructure.TIM_Period = 65535;
	TIM_TimeBaseStructure.TIM_Prescaler = 0;
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;

	TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);

	/* Prescaler configuration */
	TIM_PrescalerConfig(TIM3, PrescalerValue, TIM_PSCReloadMode_Immediate);

	/* Output Compare Timing Mode configuration: Channel1 */
	//TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_Timing;
	//TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;

	/* Output Compare Timing Mode configuration: Channel3 */
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse = CCR3_Val;

	TIM_OC3Init(TIM3, &TIM_OCInitStructure);

	TIM_OC3PreloadConfig(TIM3, TIM_OCPreload_Disable);

	/* TIM Interrupts enable */
	TIM_ITConfig(TIM3, TIM_IT_CC3, ENABLE);

	/* TIM3 enable counter */
	TIM_Cmd(TIM3, ENABLE);
}

// Setup usec delay timer
void TIM15_Init(void)
{
	uint16_t CCR3_Val,PrescalerValue;

	/* TIM15 clock enable */
	RCC_APB1PeriphClockCmd(RCC_APB2Periph_TIM15, ENABLE);

	/* Compute the prescaler value */
	PrescalerValue = (uint16_t) (SystemCoreClock  / 1000000) - 1;
	//PrescalerValue = 0;

	CCR3_Val = 0;

	/* Time base configuration */
	TIM_TimeBaseStructure.TIM_Period = 65535;
	TIM_TimeBaseStructure.TIM_Prescaler = 0;
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;

	TIM_TimeBaseInit(TIM15, &TIM_TimeBaseStructure);

	/* Prescaler configuration */
	TIM_PrescalerConfig(TIM15, PrescalerValue, TIM_PSCReloadMode_Immediate);

	/* Output Compare Timing Mode configuration: Channel3 */
	//TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	//TIM_OCInitStructure.TIM_Pulse = CCR3_Val;

	//TIM_OC3Init(TIM15, &TIM_OCInitStructure);

	//TIM_OC1PreloadConfig(TIM15, TIM_OCPreload_Disable);

	/* TIM Interrupts enable */
	//TIM_ITConfig(TIM15, TIM_IT_CC1, ENABLE);

	/* TIM3 enable counter */
	//TIM_Cmd(TIM15, ENABLE);
}

/***********************************************
 *
 *  ISRs
 *
 ***********************************************/
/**
  * @brief  This function handles TIM2 global interrupt request.
  */
void TIM2_IRQHandler(void)
{
	/* Clear TIM2 Capture compare interrupt pending bit */
	//TIM_ClearITPendingBit(TIM2, TIM_IT_CC2);
	TIM2->SR = (uint16_t)~TIM_IT_CC2;

	/* Get the Input Capture value */
	//IC2Value = TIM_GetCapture2(TIM2);
	IC2Value = TIM2->CCR2;
}

// 1 msec interrupt handler for delay countdown
void TIM3_IRQHandler(void)
{
    if (TIM_GetITStatus(TIM3, TIM_IT_CC3) != RESET)  {
		TIM_ClearITPendingBit(TIM3, TIM_IT_CC3);
		//LED2HIGH;
		if(mseccountdown1) mseccountdown1--;
		if(mseccountdown2) mseccountdown2--;
		if(mseccountdown3) mseccountdown3--;
		TIM_SetCounter(TIM3, 0);
		//LED2LOW;
    	}
}

// Interrupt handler for USART3  TX and RX buffer size set by USART3_TX_BUFSIZE and USART3_RX_BUFSIZE
void USART3_4_IRQHandler(void)
{
	// Check receive interrupt
    if (USART_GetITStatus(USART3, USART_IT_RXNE) != RESET)  {
    	USART_ClearITPendingBit(USART3, USART_IT_RXNE);
    	//LED1LOW;
		rx3buffer[rx3headptr++] = (uint8_t)(USART3->RDR & (uint16_t)0x00FF);
		if(rx3headptr==USART3_RX_BUFSIZE) rx3headptr = 0;
		if(rx3headptr==rx3tailptr) {
			rx3tailptr++;
			if(rx3tailptr==USART3_RX_BUFSIZE) rx3tailptr = 0;
			}
    	}
    // Check transmit interrupt
    if (USART_GetITStatus(USART3, USART_IT_TXE) != RESET)  {
    	USART_ClearITPendingBit(USART3, USART_IT_TXE);
    	//LED2LOW;
		USART3->TDR = tx3buffer[tx3tailptr++];
		if(tx3tailptr==USART3_TX_BUFSIZE) tx3tailptr = 0;
		// Turn off interrupt is not more data to transmit
		if(tx3tailptr==tx3headptr)  USART_ITConfig(USART3, USART_IT_TXE, DISABLE);
    	}
}

/***********************************************
 *
 *  Serial IO Functions for USB and USART3
 *
 ***********************************************/
int GetCharnw3(void)
{
	int intchar;

	// Uncomment this call if rx buffer is experiencing an overrun condition
	//if(USART_GetFlagStatus(USART3, USART_FLAG_ORE) == SET) {
	//	USART_ClearFlag(USART3, USART_FLAG_ORE);
	//	}

	if(rx3headptr!=rx3tailptr) {
		intchar = rx3buffer[rx3tailptr++];
		if(rx3tailptr==USART3_RX_BUFSIZE) rx3tailptr = 0;
		return intchar;
		}
	else return -1;
}

unsigned char GetChar3(void)
{
	int intchar;

	while((intchar=GetCharnw3())==-1) ;
	return (unsigned char) intchar;
}

void PutChar3(unsigned char outchar)
{
	if(tx3headptr==tx3tailptr) {
		tx3buffer[tx3headptr++] = outchar;
		if(tx3headptr==USART3_TX_BUFSIZE) tx3headptr = 0;
		USART_ITConfig(USART3, USART_IT_TXE, ENABLE);
		}
	else {
		tx3buffer[tx3headptr++] = outchar;
		if(tx3headptr==USART3_TX_BUFSIZE) tx3headptr = 0;
		if(tx3tailptr==tx3headptr) {
			tx3tailptr++;
			if(tx3tailptr==USART3_TX_BUFSIZE) tx3tailptr = 0;
			}
		}
}

void Puts3(unsigned char *outstrg)
{
	int i;

	for(i=0; i<strlen(outstrg); i++) PutChar3(outstrg[i]);
}

// Formated output for USART3
int printf3(const char *fmt, ...)
{
	va_list args;
	int i,j;
	char printbuffer[150];

	va_start (args, fmt);
	i = vsnprintf (printbuffer, 150, fmt, args);
	va_end (args);

	// Print the string
	j = 0;
	while(printbuffer[j]!=0) PutChar3(printbuffer[j++]);

	return i;
}

int scanf3(const char *fmt, ...)
{
	char inchar;
	va_list args;
	int i,ptr;
	char scanbuffer[120];

	ptr = 0;
	while((inchar=GetChar3())!=CR) {
        scanbuffer[ptr++] = inchar;
		//putchar(inchar);
		}
	scanbuffer[ptr] = 0;

	va_start (args, fmt);
	i = vsscanf(scanbuffer, fmt, args);
	va_end (args);

	return i;
}

