dudi938/RotalCalib/STM32F072B CDC USB Project/main.c
	RCC_AHBPeriphClockCmd(	RCC_AHBPeriph_GPIOA | RCC_AHBPeriph_GPIOB , ENABLE);



	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;

	//GPIOA OUT
	GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_8 | GPIO_Pin_9 ;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	//GPIOB OUT
	GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_All; //all 16 pin are out
	GPIO_Init(GPIOB, &GPIO_InitStructure);


	return 0;
}

// Work begins here
int main(void)
{
	char inchar;
	int intchar;
	float a,b,c;

	// Initialize all basic functions
	Short_Init();
	InitGpio();
	//STMF072_Init();

	// Fire up the USB CDC subsystem
	USBD_Init(&USB_Device_dev,
	            &USR_desc,
	            &USBD_CDC_cb,
	            &USR_cb);

	while(1) {
		intchar = GetCharnw();
		if(intchar==-1)
		{
			inchar = 0;
		}
		else
		{
			GPIOA->BRR = GPIO_Pin_8 | GPIO_Pin_9;
			GPIOB->BRR = GPIO_Pin_All;
			inchar = intchar;
			printf("%d\r\n",inchar);
		}
		switch(inchar)
		{
			case '0':
				GPIOA->BSRR |= GPIO_Pin_8;
				break;
			case '1':
				GPIOA->BSRR |= GPIO_Pin_9;
				break;
			case '2':
				GPIOB->BSRR |= GPIO_Pin_2;
				break;
			case '3':
				GPIOB->BSRR |= GPIO_Pin_3;
				break;
			case '4':
				GPIOB->BSRR |= GPIO_Pin_4;
				break;
			case '5':
				GPIOB->BSRR |= GPIO_Pin_5;
				break;
			case '6':
				GPIOB->BSRR |= GPIO_Pin_6;
				break;
			case '7':
				GPIOB->BSRR |= GPIO_Pin_7;
				break;
			case '8':
				GPIOB->BSRR |= GPIO_Pin_8;
				break;
			case '9':
				GPIOB->BSRR |= GPIO_Pin_9;
				break;
			case 'a':
				GPIOB->BSRR |= GPIO_Pin_10;
				break;
			case 'b':
				GPIOB->BSRR |= GPIO_Pin_11;
				break;
			case 'c':
				GPIOB->BSRR |= GPIO_Pin_12;
				break;
			case 'd':
				GPIOB->BSRR |= GPIO_Pin_13;
				break;
			case 'e':
				GPIOB->BSRR |= GPIO_Pin_14;
				break;
			case 'f':
				GPIOB->BSRR |= GPIO_Pin_15;
				break;
			}
		Toggle_Leds(100,200);
		}
}
